dev/controllers/MenuController.php

INSERT INTO `Menu` (`parent_id`, `name`, `url`, `icon`, `auth`, `is_open`, `is_show`, `sort`, `arr_parant`, `depth`) VALUES ('4', '业务流程条件列表', 'flowcondititon/index', '', 'flowcondititon_index', 1, 1, '0', '0,4', 2)
---
    public function actionCreate()
    {
        $model = new Menu();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `Menu` WHERE `id`='62'
---
    protected function findModel($id)
    {
        if (($model = Menu::findOne($id)) !== null) {