common/models/Department.php

    public static function getAllDatas()
    {
        $item = Department::find()->where(['status' => 1])->all();
---
SELECT * FROM `Department` WHERE `status`=1