common/models/Menu.php

SELECT * FROM `Menu` WHERE `id`='59'
---
    public function beforeSave($insert)
    {
        if($this->parent_id){
            $this->arr_parant = join(",", self::findOne($this->parent_id)->getArrParent(true));

SELECT * FROM `menu` WHERE `url`='admin/index' ORDER BY `depth` DESC
---
    public function checkActive($activeClass = 'active')
    {
        $url = self::getParentUrl();
        $menu = Menu::find()->where(['url' => $url])->orderby(['depth' => SORT_DESC])->one();

SELECT * FROM `menu` WHERE (`parent_id`='5') AND (`is_show`=1) ORDER BY `sort`
---
    public static function getMenus($parent_id = 0)
    {
        return Menu::find()->where(['parent_id' => $parent_id,"is_show" => 1])->orderby(['sort' => SORT_ASC])->all();

SELECT * FROM `menu` WHERE `url`='admin/index' ORDER BY `depth` DESC
---
    public static function getMenusByDepth($depth = 0)
    {
        $url = self::getParentUrl();//得到对应父类的地址
        $menu = Menu::find()->where(['url' => $url])->orderby(['depth' => SORT_DESC])->one();