website/controllers/AdminController.php

SELECT * FROM `admin` WHERE `id`='1'
---
    public function actionResetpwd($id) {
        $model = Admin::findOne($id);

SELECT * FROM `admin` WHERE `id` IS NULL
---
    public function actionEditpwd() {
        $model = Admin::findOne(\Yii::$app->user->getId());