website/controllers/SiteController.php

    public function actionLogout()
    {
        Admin::updateAll(["is_safety" => 1], ["id" => \Yii::$app->user->getId()]);
---
UPDATE `admin` SET `is_safety`=1 WHERE `id`='1'